# GetAreaBasedLoadBoundaryLineData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveElement..::..GetAreaBasedLoadBoundaryLineData Method
CurveElement Class See Also
---
Gets the area based load boundary line data from this curve, if applicable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public AreaBasedLoadBoundaryLineData GetAreaBasedLoadBoundaryLineData()
```

Visual Basic
---
```text
Public Function GetAreaBasedLoadBoundaryLineData As AreaBasedLoadBoundaryLineData
```

Visual C++
---
```text
public:
AreaBasedLoadBoundaryLineData^ GetAreaBasedLoadBoundaryLineData()
```

# ### Return Value
The area based load boundary line data, if this is an area based load boundary, or nullNothingnullptra null reference (Nothing in Visual Basic) otherwise.
# Remarks
Will return nullNothingnullptra null reference (Nothing in Visual Basic) if curve element isn't an area based load boundary line.
# See Also
CurveElement Class
Autodesk.Revit.DB Namespace